{
  "projects": [
    {
      "id": "sentiment-analysis",
      "title": "Sentiment Analysis",
      "description": "AI-powered sentiment analysis application for business intelligence and customer feedback analysis.",
      "category": "AI Application",
      "technologies": ["Python", "NLP", "Machine Learning", "Text Analysis"],
      "url": "projects/sentiment-analysis.html",
      "image": "assets/images/sentiment-analysis.jpg",
      "key_achievements": [
        "Built pipeline to extract financial metrics and forward-looking business strategy statements",
        "Implemented RAG system with GPT-4o for sentiment scoring",
        "Created regularization algorithms for sentiment score smoothing and validation",
        "Deliver quantitative analysis to predict customer demand across sale teams"
      ]
    },
    {
      "id": "portfolio-analysis",
      "title": "Portfolio Analysis",
      "description": "Comprehensive business analytics and portfolio management system with advanced reporting capabilities.",
      "category": "Business Analytics",
      "technologies": ["Python", "Data Analysis", "Business Intelligence", "Reporting"],
      "url": "projects/portfolio-analysis.html",
      "image": "assets/images/portfolio-analysis.jpg",
      "key_achievements": [
        "Built comprehensive ETL pipeline using Azure Synapse Analytics for portfolio data processing",
        "Developed SQL-based data warehouse with interactive PowerBI dashboards for business insights",
        "Created KPI metrics and performance analytics for investment decision support",
        "Enabled data-driven investment decisions and portfolio optimization for sales team"
      ]
    },
    {
      "id": "patent-landscaping",
      "title": "Patent Landscaping",
      "description": "AI-driven patent analysis and landscaping tool for intellectual property research and competitive analysis.",
      "category": "AI Application",
      "technologies": ["Python", "AI", "Patent Analysis", "Text Mining"],
      "url": "projects/patent-landscaping.html",
      "image": "assets/images/patent-landscaping.jpg",
      "key_achievements": [
        "Developed GenAI bot system with LangChain for automated patent analysis and categorization",
        "Implemented GPT-4, Gemini, and AutoGen integration for intelligent patent processing",
        "Built keyword clustering and priority assessment algorithms for landscape analysis",
        "Streamlined patent analysis workflow and save labor examining time"
      ]
    },
    {
      "id": "hypothesis",
      "title": "Hypothesis & Predictive Model",
      "description": "Advanced statistical modeling and hypothesis testing for data-driven decision making in manufacturing processes.",
      "category": "MLOps",
      "technologies": ["Python", "Statistics", "Machine Learning", "Predictive Modeling"],
      "url": "projects/hypothesis.html",
      "image": "assets/images/hypothesis-model.jpg",
      "key_achievements": [
        "Built predictive ML model with hypothesis testing for manufacturing optimization",
        "Implemented data preprocessing pipeline with feature engineering and quality metrics",
        "Developed Plotly dashboards for performance visualization and manufacturing insights",
        "Created FastAPI service with Azure DevOps deployment for production integration",
        "Cost saving 3.8M? per year with actual payback rate 1.2"
      ]
    },
    {
      "id": "galva-process-optimization",
      "title": "Galva Process Optimization",
      "description": "Industrial process optimization using machine learning for galvanization process improvement and quality control.",
      "category": "MLOps",
      "technologies": ["Python", "Process Optimization", "Machine Learning", "Industrial IoT"],
      "url": "projects/galva-process-optimization.html",
      "image": "assets/images/galva-optimization.jpg",
      "key_achievements": [
        "Migrated archived SAS repositories to Python ML models with PySpark ETL processing",
        "Transformed manufacturing data using Azure Synapse and PySpark for real-time analytics",
        "Designed and developed Machine Learning models for real-time prediction",
        "Cost saving 1.5M€ per plant per year, with actual payback rate 1.9"
      ]
    },
    {
      "id": "web-calculator",
      "title": "Web Calculator",
      "description": "Interactive web application for complex calculations and data processing with real-time results.",
      "category": "Web Applications",
      "technologies": ["JavaScript", "HTML/CSS", "Web Development", "Interactive UI"],
      "url": "projects/web-calculator.html",
      "image": "assets/images/web-calculator.jpg",
      "key_achievements": [
        "Developed React/FastAPI web app serving 200+ users across different time zones",
        "Built dynamic form builder with Dash components for custom quote modeling",
        "Implemented authentication with hierarchical roles (Admin/Sales/Developer)",
        "Architected hybrid storage: SQLite for transactional data, Azure Blob for contract PDFs",
        "Enabled 10M+ quarterly deals across different regions"
      ]
    },
    {
      "id": "trajectory-tracking",
      "title": "Trajectory Tracking",
      "description": "Computer vision-based vehicle trajectory tracking system for transportation analytics and safety monitoring.",
      "category": "Data Analytics",
      "technologies": ["Python", "Computer Vision", "Data Analytics", "Tracking"],
      "url": "projects/trajectory-tracking.html",
      "image": "assets/images/trajectory-tracking.jpg",
      "key_achievements": [
        "Processed GPS trajectory data with Pandas and coordinate transformation algorithms",
        "Built trajectory analysis engine with distance calculations and acceleration analysis",
        "Developed FastAPI service with Plotly visualizations for real-time tracking dashboards",
        "Implemented RDP algorithm for trajectory optimization and multi-track processing"
      ]
    },
    {
      "id": "industrial-iot-optimization",
      "title": "Industrial IoT Manufacturing Optimization",
      "description": "Comprehensive IoT solution for manufacturing process optimization and real-time monitoring.",
      "category": "Computer Vision",
      "technologies": ["Python", "IoT", "Computer Vision", "Manufacturing"],
      "url": "projects/industrial-iot-optimization.html",
      "image": "assets/images/industrial-iot.jpg",
      "key_achievements": [
        "Developed Python/OpenCV backend pipeline for real-time magnetic point detection and monitoring",
        "Implemented FastAPI REST services for data collection and process optimization",
        "Built computer vision algorithms for automated quality control in manufacturing processes",
        "Architected IoT solution connecting IR thermometers and PLCs via Azure IoT Hub",
        "Cost saving 463k€ per plant during 2023 to 2024 with actual payback rate 0.9"
      ]
    },
    {
      "id": "tensile-strength-predictive-model",
      "title": "Tensile Strength Predictive Model",
      "description": "Machine learning model for predicting material tensile strength with high accuracy for quality assurance.",
      "category": "MLOps",
      "technologies": ["Python", "Machine Learning", "Predictive Modeling", "Material Science"],
      "url": "projects/tensile-strength-predictive-model.html",
      "image": "assets/images/tensile-strength.jpg",
      "key_achievements": [
        "Developed time-series forecasting model using Scikit-learn for manufacturing quality prediction",
        "Built model evaluation dashboard with cross-validation and performance metrics",
        "Deployed FastAPI service with Azure DevOps for real-time predictions",
        "Cost saving 1.8M? per year with actual payback rate 0.6"
      ]
    }
  ],
  "categories": [
    "AI Application",
    "Business Analytics",
    "MLOps",
    "Web Applications",
    "Data Analytics",
    "Computer Vision"
  ],
  "technologies": [
    "Python",
    "JavaScript",
    "HTML/CSS",
    "Machine Learning",
    "Computer Vision",
    "IoT",
    "Data Analysis",
    "Statistics",
    "Web Development"
  ]
} 